*** Solution: Using a Set

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++17 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <set>
  using namespace std;

  int main() {
      ifstream file("input");
      int sum = 0;

      while (!file.eof()) {
          string line;
          set<char> charSet;

          // Read one group’s info
          while (getline(file, line) && !line.empty()) {
              for (char c : line)
                  charSet.insert(c);
          }

          sum += charSet.size();
      }

      file.close();

      cout << "sum: " << sum << "\n";
  }
#+end_src

#+RESULTS:
: sum: 6457

*** Solution: Using a Hash Map

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++17 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <unordered_map>
  using namespace std;

  int main() {
      ifstream file("input");
      int sum = 0;

      while (!file.eof()) {
          string line;

          // NOTE: We cannot use a vector here since multiple members of
          // a group may have answered a question (e.g. ’a’). For each
          // question that is answered, we need only track it once.
          unordered_map<char, bool> answered;

          // Read one group’s info
          while (getline(file, line) && !line.empty()) {
              for (char c : line)
                  answered[c] = true;
          }

          sum += answered.size();
      }

      file.close();

      cout << "sum: " << sum << "\n";
  }
#+end_src

#+RESULTS:
: sum: 6457

*** Solution

#+begin_src C++ :includes '(<vector> <numeric> <iostream> <map>) :namespaces std :flags -std=c++17 :results verbatim
  #include <iostream>
  #include <fstream>
  #include <algorithm>
  using namespace std;

  int main() {
      ifstream file("input");
      int sum = 0;

      while (!file.eof()) {
          string line;

          // For each answer (a-z), we will track the count of how many
          // people answered it, in a hash map. We will also track how
          // many people there were in the group. After a group is
          // processed we can simply find the letters had an answer
          // count == number of members in the group.
          unordered_map<char, int> answerCount; // ’a’ => 5 etc
          int members = 0;

          while (getline(file, line) && !line.empty()) {
              for (char c : line)
                  ++answerCount[c];

              ++members;
          }

          for (char c = 'a'; c <= 'z'; ++c) {
              if (answerCount[c] == members) {
                  // All members in the group answered this question
                  ++sum;
              }
          }
      }

      file.close();

      cout << "sum: " << sum << "\n";
  }
#+end_src

#+RESULTS:
: sum: 3260

